<!-- dflook/terraform-github-actions {"workspace":"STRWIKER","backend_type":"remote","backend":"ff2b79f81f40ff3b5e71d67d0afe64fad0bf1e9ecc29030752498a1e8f17bc61","plan_job_ref":"Job Terraform Plan #139 at https://github.com/amc40/STRWIKER/actions/runs/22037677987","plan_out_hash":"9211f53e658c0f4ce701ef6d658df5a430f883f521cb0f6cc3185b60bfbf0dfc","plan_hash":"e2b3acc99aaa256c471cc6b16360a95f1eb1cb11174dc2801d197129d2858b36","plan_text_format":"diff","version":"2.2.3","closed":true} -->
Terraform plan in __terraform__ in the __STRWIKER__ workspace<details open><summary>With variables</summary>

```hcl
github_access_token        = (sensitive value)
github_owner               = "amc40"
github_repository_name     = "STRWIKER"
supabase_access_token      = (sensitive value)
supabase_database_password = (sensitive value)
supabase_organization_id   = "wmjgrzvldhnebgmdcwmk"
vercel_api_token           = (sensitive value)
```
</details>
<details>
<summary>Plan: 8 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.github_secrets.github_actions_environment_secret.database_url will be created
+   resource "github_actions_environment_secret" "database_url" {
+       created_at        = (known after apply)
+       environment       = "production"
+       id                = (known after apply)
+       key_id            = (known after apply)
+       plaintext_value   = (sensitive value)
+       remote_updated_at = (known after apply)
+       repository        = "amc40/STRWIKER"
+       repository_id     = (known after apply)
+       secret_name       = "DATABASE_URL"
+       updated_at        = (known after apply)
    }

  # module.github_secrets.github_actions_environment_secret.direct_url will be created
+   resource "github_actions_environment_secret" "direct_url" {
+       created_at        = (known after apply)
+       environment       = "production"
+       id                = (known after apply)
+       key_id            = (known after apply)
+       plaintext_value   = (sensitive value)
+       remote_updated_at = (known after apply)
+       repository        = "amc40/STRWIKER"
+       repository_id     = (known after apply)
+       secret_name       = "DIRECT_URL"
+       updated_at        = (known after apply)
    }

  # module.supabase_project.data.supabase_apikeys.main will be read during apply
 <= data "supabase_apikeys" "main" {
+       anon_key         = (sensitive value)
+       project_ref      = (known after apply)
+       publishable_key  = (sensitive value)
+       secret_keys      = (sensitive value)
+       service_role_key = (sensitive value)
    }

  # module.supabase_project.supabase_project.main will be created
+   resource "supabase_project" "main" {
+       database_password = (sensitive value)
+       id                = (known after apply)
+       instance_size     = (known after apply)
+       name              = "strwiker"
+       organization_id   = "********************"
+       region            = "eu-west-2"
    }

  # module.vercel_project_custom.vercel_project.vercel_project_with_github will be created
+   resource "vercel_project" "vercel_project_with_github" {
+       auto_assign_custom_domains                        = true
+       automatically_expose_system_environment_variables = (known after apply)
+       customer_success_code_visibility                  = (known after apply)
+       directory_listing                                 = (known after apply)
+       framework                                         = "nextjs"
+       function_failover                                 = (known after apply)
+       git_fork_protection                               = true
+       git_lfs                                           = (known after apply)
+       git_repository                                    = {
+           production_branch = (known after apply)
+           repo              = "amc40/STRWIKER"
+           type              = "github"
        }
+       id                                                = (known after apply)
+       name                                              = "strwiker"
+       node_version                                      = (known after apply)
+       oidc_token_config                                 = {
+           enabled     = false
+           issuer_mode = "global"
        }
+       prioritise_production_builds                      = (known after apply)
+       protection_bypass_for_automation_secret           = (sensitive value)
+       resource_config                                   = (known after apply)
+       serverless_function_region                        = "lhr1"
+       team_id                                           = (known after apply)
+       vercel_authentication                             = {
+           deployment_type = "standard_protection"
        }
    }

  # module.vercel_project_custom.vercel_project_environment_variable.postgres_prisma_url will be created
+   resource "vercel_project_environment_variable" "postgres_prisma_url" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "POSTGRES_PRISMA_URL"
+       project_id             = (known after apply)
+       sensitive              = true
+       target                 = [
+           "preview",
+           "production",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.postgres_url_non_pooling will be created
+   resource "vercel_project_environment_variable" "postgres_url_non_pooling" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "POSTGRES_URL_NON_POOLING"
+       project_id             = (known after apply)
+       sensitive              = true
+       target                 = [
+           "preview",
+           "production",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.supabase_anon_key will be created
+   resource "vercel_project_environment_variable" "supabase_anon_key" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "NEXT_PUBLIC_SUPABASE_ANON_KEY"
+       project_id             = (known after apply)
+       sensitive              = true
+       target                 = [
+           "preview",
+           "production",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.supabase_url will be created
+   resource "vercel_project_environment_variable" "supabase_url" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "NEXT_PUBLIC_SUPABASE_URL"
+       project_id             = (known after apply)
+       sensitive              = (known after apply)
+       target                 = [
+           "preview",
+           "production",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   environment_variables = (sensitive value)
+   supabase_api_url      = (known after apply)
+   supabase_project_id   = (known after apply)
+   vercel_project_id     = (known after apply)
+   vercel_project_name   = "strwiker"
```
</details>

:x: Error applying plan in [Terraform Apply #8](https://github.com/amc40/STRWIKER/actions/runs/22037694339)